[
  {
    "strand": "strand1",
    "strandName": "1: AI in the Classroom",
    "type": "type-workshop",
    "typeName": "Workshop",
    "title": "Expanding Inquiry: Using AI Tools to Create Simulations and Investigations",
    "presenter": "Melissa Poole - St. Paul's School",
    "email": "anonymous",
    "preview": "AI-powered tools offer new possibilities for engaging students in inquiry-based learning across disciplines. This session will explore how educators c...",
    "description": "<p>AI-powered tools offer new possibilities for engaging students in inquiry-based learning across disciplines. This session will explore how educators can use AI to create immersive simulations and investigations that go beyond passive digital interactions. While AI can generate interactive, on-screen experiences—such as historical dialogues, scientific explorations, or real-time problem-solving scenarios—it can also be used to design rich, off-screen activities, including role-playing exercises, structured debates, and hands-on investigative tasks. Drawing from classroom-tested examples of AI-driven historical simulations, this session will demonstrate how these strategies can be adapted for subjects ranging from humanities to STEM. Participants will leave with practical approaches to designing AI-enhanced simulations that foster critical thinking, deepen content understanding, and bring learning to life—both on and off the screen.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand2",
    "strandName": "2: Human-Centered Innovation",
    "type": "type-workshop",
    "typeName": "Workshop",
    "title": "Digital Dependency vs. Human Connection: Educational Strategies for the AI Character Era",
    "presenter": "Suzanne Ellinwood - St. Paul's School",
    "email": "anonymous",
    "preview": "Workshop Proposal: Digital Dependency vs. Human Connection: Educational Strategies for the AI Character Era \nProblem Statement\nThe explosive growth of...",
    "description": "<p>Workshop Proposal: Digital Dependency vs. Human Connection: Educational Strategies for the AI Character Era \nProblem Statement\nThe explosive growth of AI character apps presents an urgent risk to adolescents: emotionally manipulative relationships with digital “pals” designed to seem perfectly understanding and always available. These AI relationships create powerful dependencies that directly compete with real human connections, particularly during vulnerable late-night hours in residential settings.\nWorkshop Overview for Strand 2: Human-Centered Innovation\nThis interactive workshop presents a transferable educational model for addressing AI character risks across grades 9-12, offering practical strategies for strengthening human connection as a counterbalance to artificial relationships.\nWorkshop Structure (55 minutes)\nPhase 1: Perfect Friend Illusion (10 minutes)\nSmall group analysis of AI character conversations showing manipulation techniques\nIdentification of specific vulnerabilities in school environments\nSynthesis of key warning signs educators should recognize\nPhase 2: Three-Phase Educational Framework (25 minutes)\nIntroduction Phase: Leveraging residential meetings to expose digital manipulation and dopamine exploitation\nCore Education Phase: Demonstrating effective school-wide presentation strategies with adaptable materials\nProcessing Phase: Implementing small group discussions with grade-specific approaches\nPhase 3: Strengthening Human Connection (20 minutes)\nGrades 9-10: Building structured connection points, guided vulnerability practice, and relationship skills\nGrades 11-12: Developing student leadership, meaningful challenges, and transition preparation\nCreating immediate implementation plans for participants&#x27; schools\nPractical Takeaways\nComplete educational materials ready for immediate implementation\nAge-differentiated connection activities and discussion guides\nFaculty preparation resources requiring no specialized AI knowledge\nAssessment frameworks to measure impact on student behavior\nThis workshop demonstrates how intentional human connection serves as the most effective response to artificial intimacy, providing a model that works across educational contexts while addressing a critical emerging challenge.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand2",
    "strandName": "2: Human-Centered Innovation",
    "type": "type-presentation",
    "typeName": "Presentation and Q&A",
    "title": "Student Buy-In and \"Ungrading\" in the Humanities Classroom",
    "presenter": "Caitie Cotton - Loomis Chaffee",
    "email": "anonymous",
    "preview": "A challenges posed by AI is how to grade given the concern that students are not submitting their own work. One way to combat this is by deemphasizing...",
    "description": "<p>A challenges posed by AI is how to grade given the concern that students are not submitting their own work. One way to combat this is by deemphasizing student grades and focusing students on their genuine learning. In this presentation, we will look at ways to first create student buy-in to class activities and assessments. Then, we will talk about how systems of &quot;ungrading&quot; can further emphasize student learning and decrease student interest in AI tools. Specific approaches to ungrading will be discussed.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand1",
    "strandName": "1: AI in the Classroom",
    "type": "type-presentation",
    "typeName": "Presentation and Q&A",
    "title": "The Value of Struggle: Preserving Meaningful Learning in an AI Age",
    "presenter": "Marta Napiorkowska - St. Luke's School",
    "email": "anonymous",
    "preview": "I present my recent article, \"The Value of Struggle\" (https://edu-ai.org/the-value-of-struggle-preserving-meaningful-learning-in-an-ai-age/), which in...",
    "description": "<p>I present my recent article, &quot;The Value of Struggle&quot; (https://edu-ai.org/the-value-of-struggle-preserving-meaningful-learning-in-an-ai-age/), which includes a case study based on a small experiment that I ran in my class, &quot;Science in Literature&quot;, and the student-reported experiences of completing a difficult prompt on their own versus using ChatGPT to do so. Student testimonies align with recent research in the neuroscience of happiness, meaning and purpose. Since my article, I have also been writing a new related piece on the role that the philosophy of &quot;human dignity&quot; and Aristotelian ethics can play in articulating how best to acquire AI fluency. Sophisticated and well-articulated framing around AI-use can both earn greater buy-in from both teachers and students but also foster new answers to questions about the value of being human.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand1",
    "strandName": "1: AI in the Classroom",
    "type": "type-presentation",
    "typeName": "Presentation and Q&A",
    "title": "Overcoming students’ initial reactions to AI through text-based experiments",
    "presenter": "Kyle Conrau-Lewis - Taft School",
    "email": "anonymous",
    "preview": "AI inspires awe in students—and this first reaction presents one of the greatest challenges for writing instructors of all disciplines. Students are o...",
    "description": "<p>AI inspires awe in students—and this first reaction presents one of the greatest challenges for writing instructors of all disciplines. Students are often mesmerized by the instantaneous display of sophisticated vocabulary, rhetorical fluency and encyclopedic knowledge (notwithstanding hallucinations). Programs like ChatGPT can distill complex ideas in syntactically smooth prose while students at all levels, still honing their compositional skills and grappling with new texts and concepts, naturally produce rough ideas with cumbersome phrasing. Comparing AI output with their own drafts, many students express humility and even despondence, with variations of “I could never write anything like that.” Our current educational crisis, therefore, is not simply a matter of combating academic plagiarism but, more fundamentally, of uplifting students’ self-perceptions.</p><p>In my own classes (Grade 12 English Literature), I have used AI writing to help my students become more critical readers of AI, to see through its well-constructed prose and to question the core argument and its use of evidence. Text-based exercises (for example, role-playing, script-doctoring, flipped storytelling) can reveal unpredictable gaps in an LLM’s proficiency at textual reasoning. Students quickly learn to detect uses of textual evidence that are vague, irrelevant, or rote. By positioning students as reviewers and arbiters of AI-generated language, we can help students to recover confidence in their own competencies and analytical thinking. To reframe things more optimistically, the uneven abilities of AI present new opportunities for students to practice the art of close reading and reassert their own expertise.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand1",
    "strandName": "1: AI in the Classroom",
    "type": "type-workshop",
    "typeName": "Workshop",
    "title": "AI-Powered Pedagogy: Crafting Effective Prompts for Transformative Learning",
    "presenter": "Maureen Lamb - Miss Porter's School",
    "email": "anonymous",
    "preview": "As AI tools become increasingly integrated into classrooms, educators face a challenge: how to effectively prompt AI to generate meaningful, high-qual...",
    "description": "<p>As AI tools become increasingly integrated into classrooms, educators face a challenge: how to effectively prompt AI to generate meaningful, high-quality responses that support student learning. Many teachers struggle with vague or ineffective prompts, leading to unreliable AI-generated content that lacks educational value. This session introduces the C.L.E.A.R. Prompt Creator Protocol, a framework designed to help educators craft precise and effective AI prompts. Rather than focusing on specific AI tools, this method ensures that teachers can apply the same structured approach across different platforms—whether using ChatGPT, Claude, Gemini, or school-based AI systems. From STEM to humanities, teachers can design prompts that guide AI to generate content-specific outputs.</p><p>Participants will explore hands-on activities using the C.L.E.A.R. framework:\nClarity: Crafting precise prompts that yield useful AI-generated responses.\nLayout: Structuring AI interactions for different learning objectives (e.g., quizzes, dialogues, essays).\nExamples: Providing AI with models to enhance the quality of responses.\nAim: Defining educational goals to align AI-generated content with learning outcomes.\nRelevance: Ensuring prompts reflect contextual needs and student engagement strategies.</p><p>Attendees will practice designing AI prompts for lesson planning, assessment creation, and student engagement, ensuring they leave with practical, classroom-ready applications.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand2",
    "strandName": "2: Human-Centered Innovation",
    "type": "type-discussion",
    "typeName": "Facilitated Discussion",
    "title": "Slavery and Loomis Chaffee: An Ethical History Project: Collaborating with Students to Make Meaning in and out of the Classroom",
    "presenter": "Eric LaForest - LC",
    "email": "anonymous",
    "preview": "After a brief presentation on Slavery and Loomis Chaffee: An Ethical History Project (linked below), this session will invite participants to begin to...",
    "description": "<p>After a brief presentation on Slavery and Loomis Chaffee: An Ethical History Project (linked below), this session will invite participants to begin to design similar projects that center student-faculty collaboration on projects that involve research and community engagement. We hope to have an open conversation about what a project like ours might look like at your school. Practical considerations on implementing years-long projects or completing historical research could be addressed, but our hope is to focus primarily on the ways this kind of collaborative, values-driven work can be meaningful for all involved in this current moment.</p><p>https://loomisethicalhistory.squarespace.com/</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand2",
    "strandName": "2: Human-Centered Innovation",
    "type": "type-presentation",
    "typeName": "Presentation and Q&A",
    "title": "“Crafting the Future: Customizing Artificial Intelligence (AI) Tools to Enhance Student Experiences & Learning Outcomes in Curriculum Development.\"",
    "presenter": "Marley Matlack - The Loomis Chaffee School",
    "email": "anonymous",
    "preview": "Artificial Intelligence and Large Language Models offer exciting possibilities for real-world learning—but they also surface a clear challenge: how ca...",
    "description": "<p>Artificial Intelligence and Large Language Models offer exciting possibilities for real-world learning—but they also surface a clear challenge: how can educators harness AI to deepen student engagement with local contexts. Our presentation addresses this issue by showcasing an initiative that leverages a customizable GPT (a feature of ChatGPT) to foster place-based learning experiences grounded in the cultural, environmental, and historical dimensions of our campus and community.</p><p>Developed as a collaborative professional development program for faculty and students, this initiative supports curriculum design through an adaptable AI assistant that models how AI can amplify localized, meaningful learning. This approach is transferable across technologies, subject areas—from humanities to STEM—grade levels, and learning environments.</p><p>Session participants will engage with a beta version of our GPT script and explore sample activities and frameworks they can tailor to their own classrooms and institutions. By balancing educational theory with concrete applications, this session equips educators with strategies they can implement immediately to make AI-enhanced, place-based learning more inclusive, accessible, and impactful.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand2",
    "strandName": "2: Human-Centered Innovation",
    "type": "type-workshop",
    "typeName": "Workshop",
    "title": "Creating a Student Learning Praxis in the Age of AI",
    "presenter": "Richard Scullin - Miss Hall's School",
    "email": "anonymous",
    "preview": "Purpose\nThis session provides teachers with a scalable unit plan that helps students develop their own philosophy–and praxis–of learning with generati...",
    "description": "<p>Purpose\nThis session provides teachers with a scalable unit plan that helps students develop their own philosophy–and praxis–of learning with generative AI. This session is relevant to 7-12 grade students across all disciplines.</p><p>Session\nThe session will provide teachers reading resources, fundamental exercises and building blocks, and essential questions to help create a student philosophy of learning. We will briefly walk attendees through student exercises and processes.</p><p>Steps\nThe unit starts with essential questions around learning, teaching, creativity, and thought. We will explore and develop a personal learning theory as a starting point for our work. Students pose and answer fundamental questions about personal learning experiences.\nStudents experiment with LLMs / Generative AI, including creative work with DALL·E, Claude, ChatGPT, etc. Students write and reflect metacognitively on their engagement with Generative AI. \nTo formulate personal understanding, we will read brief excerpts from pedagogical thinker-practitioners such as bell hooks, Paulo Freire, and Seymour Papert about learning theory, child development, and technology. \nTo complement personal understanding, we will use ChatGPT or other LLM to research learning theory by bell hooks, Paulo Freire, and Seymour Papert.\nWe will then engage in a writing prompt/project that brings all components into conversation with one another as a pathway toward a philosophy of life-long learning.</p><p>This unit challenges students to explore and develop a personal learning theory, and understand more clearly their ownership in their learning process and education.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand2",
    "strandName": "2: Human-Centered Innovation",
    "type": "type-workshop",
    "typeName": "Workshop",
    "title": "Metacognition and AI: Empowering High School Students to Become Strategic Learners in a Technological World",
    "presenter": "Luke Peterson - Episcopal High School",
    "email": "anonymous",
    "preview": "This presentation will delve into the crucial role of metacognition in preparing high school students for a future where AI is prevalent. While metaco...",
    "description": "<p>This presentation will delve into the crucial role of metacognition in preparing high school students for a future where AI is prevalent. While metacognition is already a cornerstone of the learning process, as AI becomes more prominently integrated as a tool, students should understand the role that AI plays in their academic development.</p><p>This session will explore how teachers can leverage AI tools to promote students&#x27; self-awareness of their learning processes, help them identify their strengths and weaknesses, and encourage them to monitor their progress. During the presentation, we will address specific methodologies that can teachers can integrate into their current course design that will help increase student interaction with the curriculum and their growth throughout the class.</p><p>The session will also discuss how explicit instruction in metacognitive strategies, combined with thoughtful use of AI for feedback and reflection, can empower students to become more strategic, self-directed learners who can effectively navigate and utilize AI as a tool rather than being replaced by it.</p>",
    "time": "TBD",
    "location": "TBD"
  },
  {
    "strand": "strand1",
    "strandName": "1: AI in the Classroom",
    "type": "type-presentation",
    "typeName": "Presentation and Q&A",
    "title": "What's in a Name: Metaphors We Write By",
    "presenter": "John Morrell - Loomis Chaffee",
    "email": "anonymous",
    "preview": "This session will interrogate the metaphors that shape our thinking about writing on the one hand, and those metaphors that frame our discussions abou...",
    "description": "<p>This session will interrogate the metaphors that shape our thinking about writing on the one hand, and those metaphors that frame our discussions about artificial intelligence and teaching &amp; learning, focusing on the intersections of these sets of formative analogies.</p>",
    "time": "TBD",
    "location": "TBD"
  }
]
